Modules/Architect/Http/Controllers/ContentController.php

select * from `fields` where `fields`.`typology_id` in ('2')
select * from `users`
---
    public function show(Content $content, Request $request)
    {
        if($content->typology) {
            $content->typology->load('fields');
        }

        return view('architect::contents.show', [
            'content' => $content->load('tags', 'categories'),
            'typology' => $content->typology,
            'fields' => (new FieldsReactAdapter($content))->get(),
            'users' => User::all(),
            'tags' => Tag::all(),
            'categories' => Category::all()
        ]);